
## Plan Result

[CI link](https://github.com/ruzickap/my-git-projects/actions/runs/16690185510)


<pre><code>Plan: 0 to add, 18 to change, 0 to destroy.</code></pre>

* Update
  * cloudflare_dns_record.ruzicka_dev_mx_records[&#34;mx1&#34;]
  * cloudflare_dns_record.ruzicka_dev_txt_records[&#34;cf2024-1._domainkey&#34;]
  * cloudflare_dns_record.ruzicka_dev_txt_records[&#34;spf&#34;]
  * cloudflare_dns_record.xvx_cz_cname_records[&#34;cestovani&#34;]
  * cloudflare_dns_record.xvx_cz_cname_records[&#34;www.linux&#34;]
  * cloudflare_dns_record.xvx_cz_cname_records[&#34;www.ruzickovabozena&#34;]
  * cloudflare_dns_record.xvx_cz_cname_records[&#34;www.svatba&#34;]
  * cloudflare_pages_project.ruzickap_github_io
  * cloudflare_zero_trust_access_application.applications[&#34;alloy-rpi&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;cadvisor-rpi&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;esphome-rpi&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;gate&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;grafana-rpi&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;hass-rpi&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;kodi-rpi&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;prometheus-rpi&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;rpi&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;zigbee2mqtt-rpi&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_dns_record.ruzicka_dev_mx_records["mx1"] will be updated in-place
  ~ resource "cloudflare_dns_record" "ruzicka_dev_mx_records" {
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-07-30T17:34:29Z" -> (known after apply)
        id                  = "d0e76697bef0cc42a3bda321c6718b00"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-07-30T17:34:29Z" -> (known after apply)
        name                = "ruzicka.dev"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags                = [] -> (known after apply)
      + tags_modified_on    = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # cloudflare_dns_record.ruzicka_dev_txt_records["cf2024-1._domainkey"] will be updated in-place
  ~ resource "cloudflare_dns_record" "ruzicka_dev_txt_records" {
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-07-30T17:34:29Z" -> (known after apply)
        id                  = "b57d74c4207949419eed79426a79ada8"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-07-30T17:34:29Z" -> (known after apply)
        name                = "cf2024-1._domainkey.ruzicka.dev"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags                = [] -> (known after apply)
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.ruzicka_dev_txt_records["spf"] will be updated in-place
  ~ resource "cloudflare_dns_record" "ruzicka_dev_txt_records" {
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-07-30T17:34:29Z" -> (known after apply)
        id                  = "7ad39b456f39cd4be7a205f3d3d01b2b"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-07-30T17:34:29Z" -> (known after apply)
        name                = "ruzicka.dev"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags                = [] -> (known after apply)
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.xvx_cz_cname_records["cestovani"] will be updated in-place
  ~ resource "cloudflare_dns_record" "xvx_cz_cname_records" {
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-07-30T17:28:50Z" -> (known after apply)
        id                  = "2071b139d06452a796ea0c6c90e01164"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-08-02T05:09:34Z" -> (known after apply)
        name                = "cestovani.xvx.cz"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          ~ flatten_cname = false -> (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags                = [] -> (known after apply)
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.xvx_cz_cname_records["www.linux"] will be updated in-place
  ~ resource "cloudflare_dns_record" "xvx_cz_cname_records" {
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-07-30T17:28:50Z" -> (known after apply)
        id                  = "710ca1eb4e3dbbc6595c311e35fa7dca"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-08-02T05:09:34Z" -> (known after apply)
        name                = "www.linux.xvx.cz"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          ~ flatten_cname = false -> (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags                = [] -> (known after apply)
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.xvx_cz_cname_records["www.ruzickovabozena"] will be updated in-place
  ~ resource "cloudflare_dns_record" "xvx_cz_cname_records" {
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-07-30T17:28:50Z" -> (known after apply)
        id                  = "10d8f0bd9f189c6fab3296e8f4304d4a"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-08-02T05:09:34Z" -> (known after apply)
        name                = "www.ruzickovabozena.xvx.cz"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          ~ flatten_cname = false -> (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags                = [] -> (known after apply)
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.xvx_cz_cname_records["www.svatba"] will be updated in-place
  ~ resource "cloudflare_dns_record" "xvx_cz_cname_records" {
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-07-30T17:28:51Z" -> (known after apply)
        id                  = "b6821c7dd6a57fa6ced05d9ba7220bf6"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-08-02T05:09:34Z" -> (known after apply)
        name                = "www.svatba.xvx.cz"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          ~ flatten_cname = false -> (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags                = [] -> (known after apply)
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_pages_project.ruzickap_github_io will be updated in-place
  ~ resource "cloudflare_pages_project" "ruzickap_github_io" {
      - build_config         = {} -> null
      ~ canonical_deployment = {
          + aliases            = (known after apply)
          ~ build_config       = {
              + build_caching       = (known after apply)
              + build_command       = (known after apply)
              + destination_dir     = (known after apply)
              + root_dir            = (known after apply)
              + web_analytics_tag   = (known after apply)
              + web_analytics_token = (sensitive value)
            } -> (known after apply)
          ~ created_on         = "2025-07-24T10:29:15Z" -> (known after apply)
          ~ deployment_trigger = {
              ~ metadata = {
                  ~ branch         = "main" -> (known after apply)
                  ~ commit_hash    = "1286c6ce95a4f640b477bf9fbd6d99e37060e811" -> (known after apply)
                  ~ commit_message = "chore(main): release 1.0.0" -> (known after apply)
                } -> (known after apply)
              ~ type     = "ad_hoc" -> (known after apply)
            } -> (known after apply)
          ~ env_vars           = {} -> (known after apply)
          ~ environment        = "production" -> (known after apply)
          ~ id                 = "873a2a52-b505-4746-b4e3-cff0ef491a15" -> (known after apply)
          ~ is_skipped         = false -> (known after apply)
          ~ latest_stage       = {
              ~ ended_on   = "2025-07-24T10:29:18Z" -> (known after apply)
              ~ name       = "deploy" -> (known after apply)
              + started_on = (known after apply)
              ~ status     = "success" -> (known after apply)
            } -> (known after apply)
          ~ modified_on        = "2025-07-24T10:29:18Z" -> (known after apply)
          ~ project_id         = "59418a45-7a28-47bc-9b3a-12d9d882a4f3" -> (known after apply)
          ~ project_name       = "ruzickap-github-io" -> (known after apply)
          ~ short_id           = "873a2a52" -> (known after apply)
          + source             = (known after apply)
          ~ stages             = [
              - {
                  - name       = "queued" -> null
                  - started_on = "2025-07-24T10:29:15Z" -> null
                  - status     = "active" -> null
                },
              - {
                  - name   = "initialize" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "clone_repo" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "build" -> null
                  - status = "idle" -> null
                },
              - {
                  - ended_on = "2025-07-24T10:29:18Z" -> null
                  - name     = "deploy" -> null
                  - status   = "success" -> null
                },
            ] -> (known after apply)
          ~ url                = "https://873a2a52.ruzickap-github-io.pages.dev" -> (known after apply)
        } -> (known after apply)
      ~ created_on           = "2025-06-25T13:46:04Z" -> (known after apply)
      - deployment_configs   = {
          - preview    = {
              - compatibility_date  = "2025-06-25" -> null
              - compatibility_flags = [] -> null
            } -> null
          - production = {
              - compatibility_date  = "2025-06-25" -> null
              - compatibility_flags = [] -> null
            } -> null
        } -> null
      ~ domains              = [
          - "ruzickap-github-io.pages.dev",
        ] -> (known after apply)
        id                   = "ruzickap-github-io"
      ~ latest_deployment    = {
          + aliases            = (known after apply)
          ~ build_config       = {
              + build_caching       = (known after apply)
              + build_command       = (known after apply)
              + destination_dir     = (known after apply)
              + root_dir            = (known after apply)
              + web_analytics_tag   = (known after apply)
              + web_analytics_token = (sensitive value)
            } -> (known after apply)
          ~ created_on         = "2025-07-24T10:29:15Z" -> (known after apply)
          ~ deployment_trigger = {
              ~ metadata = {
                  ~ branch         = "main" -> (known after apply)
                  ~ commit_hash    = "1286c6ce95a4f640b477bf9fbd6d99e37060e811" -> (known after apply)
                  ~ commit_message = "chore(main): release 1.0.0" -> (known after apply)
                } -> (known after apply)
              ~ type     = "ad_hoc" -> (known after apply)
            } -> (known after apply)
          ~ env_vars           = {} -> (known after apply)
          ~ environment        = "production" -> (known after apply)
          ~ id                 = "873a2a52-b505-4746-b4e3-cff0ef491a15" -> (known after apply)
          ~ is_skipped         = false -> (known after apply)
          ~ latest_stage       = {
              ~ ended_on   = "2025-07-24T10:29:18Z" -> (known after apply)
              ~ name       = "deploy" -> (known after apply)
              + started_on = (known after apply)
              ~ status     = "success" -> (known after apply)
            } -> (known after apply)
          ~ modified_on        = "2025-07-24T10:29:18Z" -> (known after apply)
          ~ project_id         = "59418a45-7a28-47bc-9b3a-12d9d882a4f3" -> (known after apply)
          ~ project_name       = "ruzickap-github-io" -> (known after apply)
          ~ short_id           = "873a2a52" -> (known after apply)
          + source             = (known after apply)
          ~ stages             = [
              - {
                  - name       = "queued" -> null
                  - started_on = "2025-07-24T10:29:15Z" -> null
                  - status     = "active" -> null
                },
              - {
                  - name   = "initialize" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "clone_repo" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "build" -> null
                  - status = "idle" -> null
                },
              - {
                  - ended_on = "2025-07-24T10:29:18Z" -> null
                  - name     = "deploy" -> null
                  - status   = "success" -> null
                },
            ] -> (known after apply)
          ~ url                = "https://873a2a52.ruzickap-github-io.pages.dev" -> (known after apply)
        } -> (known after apply)
        name                 = "ruzickap-github-io"
      ~ subdomain            = "ruzickap-github-io.pages.dev" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["alloy-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
        id                         = "8fde7fd4-42e2-4894-b294-bcc9b9b397d8"
        name                       = "alloy-rpi"
      ~ tags                       = [
          - "wifi",
            "rpi",
          + "wifi",
        ]
        # (13 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["cadvisor-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
        id                         = "23c6339a-1180-4b2d-830b-aa0d49075a3c"
        name                       = "cadvisor-rpi"
      ~ tags                       = [
          - "wifi",
            "rpi",
          + "wifi",
        ]
        # (13 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["esphome-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
        id                         = "3d3c719a-f401-4bd5-a8ce-3269da517a01"
        name                       = "esphome-rpi"
      ~ tags                       = [
          - "iot",
            "container",
          - "wifi",
          + "iot",
            "rpi",
          + "wifi",
        ]
        # (13 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["gate"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
        id                         = "1b07c21c-b6a3-4cf7-8323-cc0bf3b87366"
        name                       = "gate"
      ~ tags                       = [
          + "lan",
            "router",
            "wan",
          - "lan",
        ]
        # (13 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["grafana-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
        id                         = "d6021cc8-c8d0-44ad-93df-935e9098c6e8"
        name                       = "grafana-rpi"
      ~ tags                       = [
          - "wifi",
            "rpi",
          + "wifi",
        ]
        # (13 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["hass-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
        id                         = "5e21c854-67c3-4743-9331-0c26fc142c9e"
        name                       = "hass-rpi"
      ~ tags                       = [
          - "iot",
            "container",
          - "wifi",
          + "iot",
            "rpi",
          + "wifi",
        ]
        # (13 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["kodi-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
        id                         = "0978a798-f1f8-414c-969c-2d4fa62b4788"
        name                       = "kodi-rpi"
      ~ tags                       = [
          - "wifi",
            "rpi",
          + "wifi",
        ]
        # (13 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["prometheus-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
        id                         = "49bd24ef-5b6e-4eeb-a911-f4caac54f233"
        name                       = "prometheus-rpi"
      ~ tags                       = [
          - "wifi",
            "rpi",
          + "wifi",
        ]
        # (13 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
        id                         = "c366d9bd-48cc-44cc-bdf2-1d68acc8d6c4"
        name                       = "rpi"
      ~ tags                       = [
            "container",
          - "wifi",
            "rpi",
          + "wifi",
        ]
        # (13 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["zigbee2mqtt-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
        id                         = "bee8ee72-35aa-4941-b213-68afe733f2b2"
        name                       = "zigbee2mqtt-rpi"
      ~ tags                       = [
          - "iot",
            "container",
          - "wifi",
          + "iot",
            "rpi",
          + "wifi",
        ]
        # (13 unchanged attributes hidden)
    }

Plan: 0 to add, 18 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"tofu-cloudflare","PRNumber":190,"Program":"tfcmt","SHA1":"d588e23b247b171cf975a89aa167bee2697867da","Vars":{},"WorkflowName":"tofu-cloudflare"} -->